<a href="https://colab.research.google.com/github/alexiseduardodiazdeleonhernand-bit/alex/blob/main/Untitled9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd
import numpy as np

In [12]:
data_frame = pd.read_csv("datos_casas_india.csv")

obtener  toda la informacion de dataframe

In [13]:
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   house_type        5000 non-null   object
 1   house_size        5000 non-null   object
 2   location          5000 non-null   object
 3   city              5000 non-null   object
 4   latitude          5000 non-null   float64
 5   longitude         5000 non-null   float64
 6   price             5000 non-null   int64
 7   currency          5000 non-null   object
 8   numBathrooms      4975 non-null   float64
 9   numBalconies      2737 non-null   float64
 10  isNegotiable      179 non-null    object
 11  priceSqFt         0 non-null      float64
 12  verificationDate  5000 non-null   object
 13  description       4715 non-null   object
 14  SecurityDeposit   5000 non-null   object
 15  Status            5000 non-null   object
dtypes: float64(5), int64(1), object(10)
memory usage: 625.1+ KB

máscara para filtrar por precio >= 10,000

In [15]:
print(data_frame[data_frame["price"] >= 10000])

                    house_type   house_size            location   city  \
0       1 RK Studio Apartment     400 sq ft             Kalkaji  Delhi
1       1 RK Studio Apartment     400 sq ft   Mansarover Garden  Delhi
3     3 BHK Independent House   1,020 sq ft          Model Town  Delhi
4             2 BHK Apartment     810 sq ft    Sector 13 Rohini  Delhi
5             3 BHK Apartment     750 sq ft           DLF Farms  Delhi
...                        ...          ...                 ...    ...
4995              4 BHK Villa   5,896 sq ft        Sunder Nagar  Delhi
4996  5 BHK Independent House   6,521 sq ft        Sunder Nagar  Delhi
4997  3 BHK Independent Floor   1,855 sq ft  New Friends Colony  Delhi
4998  3 BHK Independent Floor   2,856 sq ft  New Friends Colony  Delhi
4999  3 BHK Independent Floor   2,856 sq ft  New Friends Colony  Delhi

       latitude  longitude    price currency  numBathrooms  numBalconies  \
0     28.545561  77.254349    22000      INR           1.0           NaN
1     28.643259  77.132828    20000      INR           1.0           NaN
3     28.712898  77.180000    48000      INR           3.0           NaN
4     28.723539  77.131424    20000      INR           2.0           NaN
5     28.488153  77.156975    11000      INR           1.0           NaN
...         ...        ...      ...      ...           ...           ...
4995  28.618437  76.961784  1022001      INR           4.0           2.0
4996  28.618437  76.961784  1549181      INR           4.0           2.0
4997  28.567051  77.273560   301012      INR           3.0           2.0
4998  28.567051  77.273560   301011      INR           3.0           2.0
4999  28.567051  77.273560   301012      INR           4.0           2.0

     isNegotiable  priceSqFt     verificationDate  \
0             NaN        NaN     Posted a day ago
1             NaN        NaN    Posted 9 days ago
3             NaN        NaN    Posted a year ago
4             NaN        NaN    Posted a year ago
5             NaN        NaN   Posted 2 years ago
...           ...        ...                  ...
4995          NaN        NaN  Posted 2 months ago
4996          NaN        NaN  Posted 2 months ago
4997          NaN        NaN  Posted 2 months ago
4998          NaN        NaN  Posted 2 months ago
4999          NaN        NaN  Posted 2 months ago

                                            description SecurityDeposit  \
0     Fully furnished, loaded with amenities & gadge...      No Deposit
1     Here is an excellent 1 BHK Independent Floor a...      No Deposit
3     Itâs a 3 bhk independent house situated in M...      No Deposit
4     Well designed 2 bhk multistorey apartment is a...      No Deposit
5     Well designed 3 bhk multistorey apartment is a...      No Deposit
...                                                 ...             ...
4995  Its four bhk villa in the super location of De...       40,10,102
4996  A 5 bhk property is available for rent in Sund...       54,01,015
4997  Its three bhk builder floor in the super locat...       18,18,181
4998  Its three bhk builder floor in the super locat...       10,10,110
4999  Its three bhk builder floor in the super locat...       10,10,182

              Status
0          Furnished
1          Furnished
3          Furnished
4        Unfurnished
5     Semi-Furnished
...              ...
4995     Unfurnished
4996     Unfurnished
4997     Unfurnished
4998     Unfurnished
4999     Unfurnished

[4827 rows x 16 columns]

cuantas son inferiores a 10,000

In [17]:
print(data_frame[data_frame["price"] < 10000])

                    house_type   house_size        location   city   latitude  \
2     2 BHK Independent Floor     500 sq ft     Uttam Nagar  Delhi  28.618677
77    1 BHK Independent Floor     700 sq ft     Uttam Nagar  Delhi  28.619457
84    1 BHK Independent Floor     360 sq ft        Badarpur  Delhi  28.491892
88            2 BHK Apartment     480 sq ft     Uttam Nagar  Delhi  28.618303
93    1 BHK Independent Floor     450 sq ft  Mansa Ram Park  Delhi  28.618078
...                        ...          ...             ...    ...        ...
4499  2 BHK Independent House     445 sq ft          Burari  Delhi  28.760500
4502          2 BHK Apartment   1,800 sq ft     Uttam Nagar  Delhi  28.618809
4503  1 BHK Independent Floor     500 sq ft           Saket  Delhi  28.523548
4939  1 BHK Independent House     333 sq ft        dda flat  Delhi  28.655981
4948          1 BHK Apartment     450 sq ft          Nawada  Delhi  28.627590

      longitude  price currency  numBathrooms  numBalconies isNegotiable  \
2     77.053352   8500      INR           1.0           NaN          NaN
77    77.056709   8500      INR           1.0           NaN          NaN
84    77.306938   8000      INR           1.0           NaN          NaN
88    77.056946   6500      INR           1.0           NaN          NaN
93    77.040871   8500      INR           1.0           NaN          NaN
...         ...    ...      ...           ...           ...          ...
4499  77.188286   5500      INR           1.0           NaN   Negotiable
4502  77.058998   9000      INR           1.0           1.0   Negotiable
4503  77.200142   8000      INR           1.0           NaN   Negotiable
4939  77.311623   4500      INR           1.0           1.0          NaN
4948  77.028709   5500      INR           1.0           1.0          NaN

      priceSqFt    verificationDate  \
2           NaN  Posted 12 days ago
77          NaN  Posted a month ago
84          NaN  Posted 3 years ago
88          NaN  Posted 4 years ago
93          NaN  Posted a month ago
...         ...                 ...
4499        NaN   Posted a year ago
4502        NaN   Posted a year ago
4503        NaN   Posted a year ago
4939        NaN   Posted a year ago
4948        NaN   Posted a year ago

                                            description SecurityDeposit  \
2     Zero Brokerage.\r\n\r\n2 Room set, Govt bijali...      No Deposit
77    This is a well-designed 1 BHK Independent Floo...      No Deposit
84    This spacious 1 bhk builder floor is available...      No Deposit
88                                                  NaN      No Deposit
93    This is a modern and stylish home available fo...      No Deposit
...                                                 ...             ...
4499  This spacious 2 bhk independent house is avail...           5,000
4502  2 BHK 3rd flr front side with lift with bike p...           9,000
4503  This spacious 1 bhk builder floor is available...           8,000
4939  It has area of 333 sqft and is available at a ...           4,500
4948  Well designed 1 bhk multistorey apartment is a...           5,500

              Status
2     Semi-Furnished
77    Semi-Furnished
84       Unfurnished
88    Semi-Furnished
93       Unfurnished
...              ...
4499     Unfurnished
4502  Semi-Furnished
4503  Semi-Furnished
4939  Semi-Furnished
4948  Semi-Furnished

[173 rows x 16 columns]

dataframe con los valores de casas inferiores a 10,000

In [18]:
df = data_frame['price'] < 10000
df

0       False
1       False
2        True
3       False
4       False
        ...
4995    False
4996    False
4997    False
4998    False
4999    False
Name: price, Length: 5000, dtype: bool

toda la info del df

In [19]:
df.info()

<class 'pandas.core.series.Series'>
RangeIndex: 5000 entries, 0 to 4999
Series name: price
Non-Null Count  Dtype
--------------  -----
5000 non-null   bool
dtypes: bool(1)
memory usage: 5.0 KB

crear una serie con todas las direcciones de las casas >= 10,000

In [21]:
s = data_frame[data_frame["price"] >= 10000]["location"]
s

0                  Kalkaji
1        Mansarover Garden
3               Model Town
4         Sector 13 Rohini
5                DLF Farms
               ...
4995          Sunder Nagar
4996          Sunder Nagar
4997    New Friends Colony
4998    New Friends Colony
4999    New Friends Colony
Name: location, Length: 4827, dtype: object